# Taps
tap "planetscale/tap"

# CLI Tools
brew "ag"           # The Silver Searcher - fast code search
brew "deno"         # Deno runtime
brew "fzf"          # Fuzzy finder
brew "git-delta"    # Better git diff
brew "glow"         # Markdown renderer
brew "gum"          # Shell script UI components
brew "bash"         # Modern bash (macOS ships old version)
brew "bat"          # Better cat with syntax highlighting
brew "bottom"       # System monitor (btm)
brew "cmake"
brew "direnv"       # Per-directory environment variables
brew "fd"           # Better find
brew "fish"         # Fish shell
brew "fx"           # JSON viewer
brew "gh"           # GitHub CLI
brew "git"
brew "git-crypt"    # Transparent file encryption in git
brew "go"
brew "gnu-getopt"
brew "jq"           # JSON processor
brew "lsd"          # Better ls
brew "mdcat"        # Markdown renderer for terminal
brew "neovim"       # Editor
brew "node"         # Node.js runtime
brew "pandoc"       # Document converter
brew "planetscale/tap/pscale"  # PlanetScale CLI
brew "pre-commit"
brew "rust"         # Rust toolchain
brew "shellcheck"   # Shell script linter
brew "shfmt"        # Shell formatter
brew "tree"
brew "up"           # Ultimate Plumber - interactive piping
brew "uv"           # Fast Python package manager
brew "watch"
brew "watchman"     # File watcher
brew "wget"
brew "xh"           # Better curl/httpie
brew "yj"           # YAML/JSON/TOML converter
brew "pnpm"         # Fast package manager
brew "tldr"         # Simplified man pages with examples
brew "lazygit"      # Terminal UI for git
brew "hyperfine"    # CLI benchmarking tool

# System Tools
brew "dockutil"     # Manage Dock items
brew "mas"          # Mac App Store CLI

# Email
brew "himalaya"     # Email CLI
brew "imapfilter"   # IMAP filtering
brew "isync"        # IMAP sync (mbsync)
brew "notmuch"      # Email indexer/search

# Applications
cask "caffeine"       # Prevent sleep
cask "chatgpt"        # ChatGPT desktop
cask "claude"         # Claude desktop
cask "cleanshot"      # Screenshot tool
cask "discord"
cask "docker-desktop"
cask "dropbox"
cask "figma"
cask "ghostty"
cask "linear-linear"  # Linear app
cask "loom"           # Screen recording
cask "meetingbar"     # Calendar in menubar
cask "ngrok"
cask "notion"
cask "raycast"
cask "steam"
cask "transmission"   # Torrent client
cask "vlc"
cask "zed"
cask "zoom"

# Screensavers
cask "aerial"         # Apple TV aerial screensavers

# Fonts
cask "font-fira-code"
cask "font-monaspace"

# Mac App Store
mas "DaisyDisk", id: 411643860
mas "Pixelmator Pro", id: 1289583905
mas "Refined GitHub", id: 1519867270
mas "TripMode", id: 1513400665
mas "Unsplash Wallpapers", id: 1284863847
