# ═══════════════════════════════════════════════════════════
# Taps
# ═══════════════════════════════════════════════════════════
tap "planetscale/tap"
tap "polidog/kilar"

# ═══════════════════════════════════════════════════════════
# CLI Tools
# ═══════════════════════════════════════════════════════════

# Modern Unix replacements
brew "bat"           # cat with syntax highlighting
brew "bottom"        # top/htop replacement (btm)
brew "fd"            # find replacement
brew "ag"            # grep replacement (Silver Searcher)
brew "lsd"           # ls with icons/colors
brew "xh"            # curl/httpie replacement
brew "git-delta"     # diff with syntax highlighting

# Search & navigation
brew "fzf"           # fuzzy finder
brew "tree"          # directory tree view
brew "tldr"          # simplified man pages

# Data processing
brew "jq"            # JSON processor
brew "fx"            # interactive JSON viewer
brew "yj"            # YAML/JSON/TOML converter

# Shell & scripting
brew "fish"          # modern shell
brew "bash"          # modern bash (macOS ships old version)
brew "direnv"        # per-directory env vars
brew "shellcheck"    # shell script linter
brew "shfmt"         # shell formatter
brew "gum"           # shell script UI components
brew "up"            # interactive piping (Ultimate Plumber)

# Git & GitHub
brew "git"
brew "gh"            # GitHub CLI
brew "git-delta"     # better diffs (also in gitconfig)
brew "git-crypt"     # transparent file encryption
brew "lazygit"       # terminal UI for git
brew "pre-commit"    # git hooks framework

# Development
brew "node@24"       # Node.js LTS runtime
brew "pnpm"          # fast package manager
brew "deno"          # Deno runtime
brew "go"
brew "rust"
brew "uv"            # fast Python package manager
brew "neovim"        # editor
brew "cmake"
brew "gnu-getopt"
brew "hyperfine"     # CLI benchmarking

# Documents & text
brew "glow"          # render markdown in terminal
brew "mdcat"         # render markdown (alternative)
brew "pandoc"        # document converter

# System utilities
brew "watch"         # run command repeatedly
brew "watchman"      # file watcher
brew "wget"
brew "unar"          # universal archive extractor
brew "polidog/kilar/kilar"  # interactive port/process manager

# Database
brew "planetscale/tap/pscale"

# Cloud
brew "awscli"        # AWS command line interface

# ═══════════════════════════════════════════════════════════
# System Tools (macOS)
# ═══════════════════════════════════════════════════════════
brew "dockutil"      # manage Dock items
brew "mas"           # Mac App Store CLI

# ═══════════════════════════════════════════════════════════
# Email (CLI workflow)
# ═══════════════════════════════════════════════════════════
brew "isync"         # IMAP sync (mbsync)
brew "notmuch"       # email indexer/search
brew "himalaya"      # email CLI
brew "imapfilter"    # server-side filtering

# ═══════════════════════════════════════════════════════════
# Applications (Casks)
# ═══════════════════════════════════════════════════════════

# Productivity
cask "raycast"        # launcher (Spotlight replacement)
cask "meetingbar"     # calendar in menubar
cask "cleanshot"      # screenshot tool
cask "loom"           # screen recording
cask "notion"
cask "linear-linear"
cask "figma"

# Development
cask "zed"            # editor
cask "ghostty"        # terminal
cask "docker-desktop"
cask "ngrok"

# AI
cask "claude"
cask "chatgpt"

# Communication
cask "discord"
cask "zoom"

# Media
cask "vlc"
cask "steam"
cask "transmission"   # torrent client

# Utilities
cask "caffeine"       # prevent sleep
cask "dropbox"
cask "keyboardcleantool"  # disable keyboard for cleaning

# ═══════════════════════════════════════════════════════════
# Screensavers
# ═══════════════════════════════════════════════════════════
cask "aerial"         # Apple TV aerials

# ═══════════════════════════════════════════════════════════
# Fonts
# ═══════════════════════════════════════════════════════════
cask "font-fira-code"
cask "font-monaspace"

# ═══════════════════════════════════════════════════════════
# Mac App Store
# ═══════════════════════════════════════════════════════════
mas "DaisyDisk", id: 411643860
mas "Pixelmator Pro", id: 1289583905
mas "Refined GitHub", id: 1519867270
mas "TripMode", id: 1513400665
mas "Unsplash Wallpapers", id: 1284863847
