# ═══════════════════════════════════════════════════════════
# Taps
# ═══════════════════════════════════════════════════════════
tap "electrikmilk/cherri"
tap "planetscale/tap"
tap "polidog/kilar"
tap "assimelha/tap"
tap "zjrosen/perles"

# ═══════════════════════════════════════════════════════════
# CLI Tools
# ═══════════════════════════════════════════════════════════

# Modern Unix replacements
brew "bat"           # cat with syntax highlighting
brew "bottom"        # top/htop replacement (btm)
brew "fd"            # find replacement
brew "ripgrep"       # grep replacement (rg, faster than ag)
brew "ag"            # grep alternative (Silver Searcher)
brew "lsd"           # ls with icons/colors
brew "xh"            # curl/httpie replacement
brew "dust"          # du replacement, visual bars
brew "duf"           # df replacement, colorized table
brew "procs"         # ps replacement, colorized/tree
brew "sd"            # sed replacement, intuitive regex
brew "doggo"         # dig replacement, colorized DNS (dog successor)
brew "gping"         # ping with live graph
brew "difftastic"    # syntax-aware diff (code-aware)
brew "git-delta"     # diff with syntax highlighting
brew "lnav"          # log file navigator (syntax-aware, searchable, SQL)
brew "multitail"     # tail multiple files in split view
brew "onefetch"      # git repo info (neofetch for repos)
brew "speedtest-cli" # internet speed test
brew "neofetch"      # system info with ASCII art

# Search & navigation
brew "fzf"           # fuzzy finder
brew "television"    # fuzzy finder (Telescope-style, Rust)
brew "tree"          # directory tree view
brew "tldr"          # simplified man pages

# Data processing
brew "jq"            # JSON processor
brew "fx"            # interactive JSON viewer
brew "gron"          # make JSON greppable (flatten to path=value)
brew "yj"            # YAML/JSON/TOML converter
brew "yq"            # YAML processor (jq for YAML)

# Shell & scripting
brew "fish"          # modern shell
brew "bash"          # modern bash (macOS ships old version)
brew "starship"      # cross-shell prompt
brew "direnv"        # per-directory env vars
brew "shellcheck"    # shell script linter
brew "shfmt"         # shell formatter
brew "gum"           # shell script UI components
brew "just"          # command runner (modern make alternative)
brew "up"            # interactive piping (Ultimate Plumber)

# Apple Shortcuts
brew "electrikmilk/cherri/cherri"  # compile .cherri to .shortcut files

# Git & GitHub
brew "git"
brew "gh"            # GitHub CLI
brew "git-delta"     # better diffs (also in gitconfig)
brew "git-crypt"     # transparent file encryption
brew "lazygit"       # terminal UI for git
brew "bdui"          # terminal UI for beads (kanban, tree, graph views)
brew "perles"        # terminal UI for beads issue tracking (kanban, BQL search)
brew "gitmux"        # git status in tmux status bar
brew "tmux"          # terminal multiplexer
brew "pre-commit"    # git hooks framework

# Development
brew "node"          # bootstrap only (pnpm manages LTS)
brew "pnpm"          # fast package manager + node version manager
brew "deno"          # Deno runtime
brew "go"
brew "rust"
brew "uv"            # fast Python package manager
brew "neovim"        # editor
brew "cmake"
brew "gnu-getopt"
brew "hyperfine"     # CLI benchmarking

# Documents & text
brew "glow"          # render markdown in terminal
brew "mdcat"         # render markdown (alternative)
brew "pandoc"        # document converter

# Dotfiles management
brew "chezmoi"       # declarative dotfiles manager
brew "age"           # encryption for chezmoi secrets

# System utilities
brew "watch"         # run command repeatedly
brew "watchman"      # file watcher
brew "wget"
brew "unar"          # universal archive extractor
brew "polidog/kilar/kilar"  # interactive port/process manager

# Database
brew "planetscale/tap/pscale"

# Cloud
brew "awscli"        # AWS command line interface

# ═══════════════════════════════════════════════════════════
# System Tools (macOS)
# ═══════════════════════════════════════════════════════════
brew "dockutil"           # manage Dock items
brew "mas"                # Mac App Store CLI

# Notification tools
# - yo: Persistent notifications, custom icons - NOT in Homebrew, installed via sync script
#   https://github.com/sheagcraig/yo
# - terminal-notifier: Fallback (has issues on Sonoma+)
brew "terminal-notifier"  # CLI notifications (fallback)

# ═══════════════════════════════════════════════════════════
# Email (CLI workflow)
# ═══════════════════════════════════════════════════════════
brew "isync"         # IMAP sync (mbsync)
brew "notmuch"       # email indexer/search
brew "himalaya"      # email CLI
brew "imapfilter"    # server-side filtering

# ═══════════════════════════════════════════════════════════
# Applications (Casks)
# ═══════════════════════════════════════════════════════════

# Productivity
cask "raycast"        # launcher (Spotlight replacement)
cask "meetingbar"     # calendar in menubar
cask "cleanshot"      # screenshot tool
cask "loom"           # screen recording
cask "notion"
cask "linear-linear"
cask "figma"

# Development
cask "zed"            # editor
cask "ghostty"        # terminal (secondary)
cask "kitty"          # terminal (primary — hjkl nav via smart-splits)
cask "docker-desktop"
cask "ngrok"

# AI
cask "claude"
cask "chatgpt"

# Communication
cask "discord"
cask "zoom"

# Media
cask "vlc"
cask "steam"
cask "transmission"   # torrent client

# Utilities
cask "betterdisplay"  # display management (brightness, HiDPI, DDC)
cask "caffeine"       # prevent sleep
cask "dropbox"
cask "karabiner-elements"  # keyboard remapping (Fn sticky/toggle mode)
cask "keyboardcleantool"  # disable keyboard for cleaning

# ═══════════════════════════════════════════════════════════
# Screensavers
# ═══════════════════════════════════════════════════════════
cask "aerial"         # Apple TV aerials

# ═══════════════════════════════════════════════════════════
# Fonts
# ═══════════════════════════════════════════════════════════
cask "font-fira-code"
cask "font-monaspace"

# ═══════════════════════════════════════════════════════════
# Mac App Store
# ═══════════════════════════════════════════════════════════
mas "DaisyDisk", id: 411643860
mas "Pixelmator Pro", id: 1289583905
mas "Refined GitHub", id: 1519867270
mas "TripMode", id: 1513400665
mas "Unsplash Wallpapers", id: 1284863847

# Shortcuts Extensions (for Cherri/automation workflows)
mas "Actions", id: 1586435171          # 180+ utility actions (Sindre Sorhus)

# Manual App Store installs:
# - Toolbox Pro: https://apps.apple.com/app/id1476029992 (wrapped iOS)
# - Logger: https://apps.apple.com/app/id1611554653 ($9.99 - paid)
# - Scriptable: https://apps.apple.com/app/id1405459188 (iOS only)

# ═══════════════════════════════════════════════════════════
# CLI Tools (overflow)
# ═══════════════════════════════════════════════════════════
brew "imagemagick"
