aaron-bond.better-comments
alefragnani.project-manager
antfu.icons-carbon
anthropic.claude-code
asvetliakov.vscode-neovim
bmalehorn.vscode-fish
bradlc.vscode-tailwindcss
christian-kohler.path-intellisense
dbaeumer.vscode-eslint
dprint.dprint
effectful-tech.effect-vscode
emilast.logfilehighlighter
enkia.tokyo-night
github.vscode-github-actions
github.vscode-pull-request-github
graphql.vscode-graphql
graphql.vscode-graphql-syntax
hashicorp.terraform
jasonkuhrt.explorer-delete
jasonkuhrt.utils
jasonkuhrt.workbench-cycler
mathematic.vscode-pdf
mechatroner.rainbow-csv
meganrogge.template-string-converter
mikestead.dotenv
ms-azuretools.vscode-docker
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
oxc.oxc-vscode
pflannery.vscode-versionlens
prisma.prisma
rastikerdar.vscode-seedling-icon-theme
redhat.vscode-yaml
sleistner.vscode-fileutils
stivo.tailwind-fold
tamasfe.even-better-toml
terrastruct.d2
typescriptteam.native-preview
usernamehw.errorlens
vitest.explorer
yoavbls.pretty-ts-errors
ziyasal.vscode-open-in-github
